%Студенты
man("Роман").
man("Петр").
man("Сергей").%Старт программы
launch:- man(X1),man(X2),man(X3), %Переменные
         not(X1 = X2),not(X1 = X3),not(X2 = X3), %Указываем, что переменные не равны
         A = [[X1, "Математический"], [X2, "Физический"], [X3, "Химический"]], %Создаем списон

         (
                 (
                     %1 условие
                     (in_list(A, ["Петр", "Математический"]),
                     not(in_list(A, ["Сергей", "Физический"])));
                     not(in_list(A, ["Петр", "Математический"]))
                 ),

                 (
                     %2 условие
                     (not(in_list(A, ["Роман", "Физический"])),
                     in_list(A, ["Петр", "Математический"]));
                     in_list(A, ["Роман", "Физический"])
                 ),

                 (
                     %3 условие
                     (not(in_list(A, ["Сергей", "Математический"])),
                     in_list(A, ["Роман", "Химический"]));
                     in_list(A, ["Сергей", "Математический"])
                 )
         ),

         %Вывод
         write(X1), write(:),write("Математический"), nl,
         write(X2), write(:),write("Физический"), nl,
         write(X3), write(:),write("Химический"), !.

%лекционный предика
in_list([El|_],El).
in_list([_|Tail],El):-in_list(Tail,El).
